bases/WIM_FIn/projects/IMDEV-7330 Оптимизация 1С ФИН_Расчет НДФЛ/Расширения/NDFL_RDU/DataProcessors/ФормированиеНачисленийНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФормированиеНачисленийНДФЛ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговыйПериод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Периоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСоздаватьДокументыПоКлиентамБезЦБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтрокиПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСтрокиС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСоздаватьДокументыБезУдержаний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СоздаватьОплатуНДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СхемаВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетДляОплатыНалогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УправляющаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьНачисленияПоЗакрытымПортфелям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьНачисленияТолькоПоПортфелямСДвижениямиПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПоЗакрытымПортфелямСПоступлениемНКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УправляющаяКомпания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СхемаРеинвестирования</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bases/WIM_FIn/projects/IMDEV-7330 Оптимизация 1С ФИН_Расчет НДФЛ/Расширения/NDFL_RDU/DataProcessors/ФормированиеНачисленийНДФЛ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// IMDEV-7330 Модуль объекта обработки «ФормированиеНачисленийНДФЛ» (расширение конфигурации NDFL_RDU).
//
// IMDEV-7330 Назначение:
//   Перехват типовых процедур формирования начислений НДФЛ и предрасчёт оборотов по портфелям;
//   воркер одной пачки NDFL_RDU_ВыполнитьПачкуФормированияНДФЛ для вызова из БСП ДлительныеОперации
//   (метод ВыполнитьПроцедуруМодуляОбъектаОбработки).

// IMDEV-7330 Переменная модуля: кэш оборотов на время одного прогона СоздатьДокументы.
// Неопределено — кэш не используется (как при вызове РассчитатьНДФЛ без предварительной подготовки).
// Иначе — структура с полями ОборотыПоПортфелю, ОборотыПрошлыйГодПоПортфелю, ШаблонОборотыТек, ШаблонОборотыПрошлыйГод
// (см. NDFL_RDU_ПолучитьОбщиеОборотыПоПортфелям в расширении документа НачислениеНДФЛПоПортфелю).
Перем NDFL_RDU_СтруктураКэшОборотов;

// IMDEV-7330 Контекст частичного прогресса по строкам ТЧ «ДатыДокументов» внутри воркера пачки (только параллельный режим).
// Неопределено — синхронный прогон или воркер без АдресРезультатаПачки (ВХ-обёртка с ОбработаноСтрокЧастично).
Перем NDFL_RDU_КонтекстЧастичногоПрогресса;

#Область ПРОГРАММНЫЙ_ИНТЕРФЕЙС

// IMDEV-7330 Описание: Перехватывает типовую СоздатьДокументы для гарантированного сброса
//           кэша оборотов в начале и в конце прогона; контекст частичного прогресса в начале не сбрасывается
//           (его перед вызовом может установить NDFL_RDU_ВыполнитьПачкуФормированияНДФЛ), сброс в конце и в Исключение.
//           Подготовка кэша оборотов выполняется один раз до ПродолжитьВызов по отборам NDFL_RDU_СобратьПарыКлиентУКСУчетомОтборовДокументов
//           (номер строки, клиенты с ЦБ при соответствующих флагах обработки); сообщения по отфильтрованным строкам
//           по-прежнему формирует типовой цикл внутри ПродолжитьВызов.
//
// Параметры:
//   ТабличныйДокумент - ТабличныйДокумент - буфер для лога обработки.
//
&Вместо("СоздатьДокументы")
Процедура NDFL_RDU_СоздатьДокументы(ТабличныйДокумент) Экспорт
	
	// IMDEV-7330 Принудительный сброс кэша на старте: если объект обработки переиспользуется
	// между вызовами (типичная ситуация для управляемой формы), кэш не должен «переживать» прогон.
	// IMDEV-7330 NDFL_RDU_КонтекстЧастичногоПрогресса здесь не обнуляем: воркер пачки выставляет его
	// перед СоздатьДокументы; обнуление в конце процедуры и в Исключение.
	NDFL_RDU_СтруктураКэшОборотов = Неопределено;
	
	Попытка
		МассивПарКлиентУК = NDFL_RDU_СобратьПарыКлиентУКСУчетомОтборовДокументов();
		NDFL_RDU_ИнициализироватьКэшОборотовПоМассивуПар(МассивПарКлиентУК);
		ПродолжитьВызов(ТабличныйДокумент);
	Исключение
		NDFL_RDU_СтруктураКэшОборотов = Неопределено;
		NDFL_RDU_КонтекстЧастичногоПрогресса = Неопределено;
		ВызватьИсключение;
	КонецПопытки;
	
	NDFL_RDU_СтруктураКэшОборотов = Неопределено;
	NDFL_RDU_КонтекстЧастичногоПрогресса = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область IMDEV7330_ПараллельноеФормированиеНДФЛ_Объект

// IMDEV-7330 Воркер одной непустой пачки формирования НДФЛ для фонового задания БСП.
// Вызывается через ДлительныеОперации.ВыполнитьВФоне("ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки", ...):
// параметры и адрес основного результата пачки в поле ПараметрыXML; итог пачки — во ВХ-обёртке по АдресРезультатаПачки (см. менеджер).
//
// Параметры:
//   ПараметрыВыполнения - Структура - ожидается свойство ПараметрыXML (сериализованная структура пачки из NDFL_RDU_ПодготовитьПараметрыПачки: НомерПачки, Шапка, СтрокиДатыДокументов, АдресРезультатаПачки).
//   АдресХранилищаРезультата - Строка - адрес ВХ для служебного признака успеха для БСП (опционально; если не указан - не записывается).
//
Процедура NDFL_RDU_ВыполнитьПачкуФормированияНДФЛ(ПараметрыВыполнения, АдресХранилищаРезультата) Экспорт
	
	// Проверка параметров
	СтрокаXMLПараметровПачки = "";
	Если Не (ПараметрыВыполнения <> Неопределено
		И ТипЗнч(ПараметрыВыполнения) = Тип("Структура")
		И ПараметрыВыполнения.Свойство("ПараметрыXML", СтрокаXMLПараметровПачки)
		И ЗначениеЗаполнено(СтрокаXMLПараметровПачки)) Тогда
		
		Если ЗначениеЗаполнено(АдресХранилищаРезультата) Тогда
			ПоместитьВоВременноеХранилище(Ложь, АдресХранилищаРезультата);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// Разбор XML параметров пачки
	ПараметрыПачки = Неопределено;
	Попытка
		ПараметрыПачки = Обработки.ФормированиеНачисленийНДФЛ.NDFL_RDU_ДанныеИзXML(СтрокаXMLПараметровПачки);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'IMDEV-7330. Формирование НДФЛ (пачка): ошибка разбора XML параметров'"),
			УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Если ЗначениеЗаполнено(АдресХранилищаРезультата) Тогда
			ПоместитьВоВременноеХранилище(Ложь, АдресХранилищаРезультата);
		КонецЕсли;
		Возврат;
	КонецПопытки;
	
	// Проверка адреса результата пачки
	АдресРезультатаПачки = "";
	Если Не ПараметрыПачки.Свойство("АдресРезультатаПачки", АдресРезультатаПачки)
		Или Не ЗначениеЗаполнено(АдресРезультатаПачки) Тогда
		
		Если ЗначениеЗаполнено(АдресХранилищаРезультата) Тогда
			ПоместитьВоВременноеХранилище(Ложь, АдресХранилищаРезультата);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	// Подготовка результата пачки
	РезультатПачки = Новый Структура("НомерПачки, ЕстьОшибка, ТекстОшибки, ТабличныйДокумент, СписокСообщений",
		0, Ложь, "", Новый ТабличныйДокумент,
		Обработки.ФормированиеНачисленийНДФЛ.NDFL_RDU_ТаблицаСообщенийПачки());
	
	ПараметрыПачки.Свойство("НомерПачки", РезультатПачки.НомерПачки);
	
	Попытка
		
		Обработки.ФормированиеНачисленийНДФЛ.NDFL_RDU_ЗаполнитьОбработкуИзПараметровПачки(ЭтотОбъект, ПараметрыПачки);
		NDFL_RDU_УстановитьКонтекстЧастичногоПрогрессаИзПараметровПачки(ПараметрыПачки);
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		СоздатьДокументы(ТабличныйДокумент);
		
		РезультатПачки.ТабличныйДокумент = ТабличныйДокумент;
		NDFL_RDU_ЗаписатьФинальныйЧастичныйПрогрессСтрокПачкиВоВХ();
		
	Исключение
		
		РезультатПачки.ЕстьОшибка = Истина;
		РезультатПачки.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'IMDEV-7330. Формирование НДФЛ (пачка)'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			СтрШаблон(НСтр("ru = 'Пачка %1: %2'"), РезультатПачки.НомерПачки, РезультатПачки.ТекстОшибки));
		
	КонецПопытки;
	
	ОбработаноСтрокЧастичноФинал = Неопределено;
	Если NDFL_RDU_КонтекстЧастичногоПрогресса <> Неопределено Тогда
		
		СчетчикСтрокПачки = 0;
		NDFL_RDU_КонтекстЧастичногоПрогресса.Свойство("СчетчикСтрокПачки", СчетчикСтрокПачки);
		СтрокВПачке = 0;
		NDFL_RDU_КонтекстЧастичногоПрогресса.Свойство("СтрокВПачке", СтрокВПачке);
		Если СтрокВПачке > 0 И СчетчикСтрокПачки > СтрокВПачке Тогда
			СчетчикСтрокПачки = СтрокВПачке;
		КонецЕсли;
		ОбработаноСтрокЧастичноФинал = СчетчикСтрокПачки;
	КонецЕсли;
	
	NDFL_RDU_КонтекстЧастичногоПрогресса = Неопределено;
	
	Обработки.ФормированиеНачисленийНДФЛ.NDFL_RDU_ПоместитьИтогПачкиВоВхОбертку(АдресРезультатаПачки, РезультатПачки, ОбработаноСтрокЧастичноФинал);
	
	// Возврат статуса для БСП (Истина, если пачка выполнена без исключения в СоздатьДокументы)
	Если ЗначениеЗаполнено(АдресХранилищаРезультата) Тогда
		ПоместитьВоВременноеХранилище(Не РезультатПачки.ЕстьОшибка, АдресХранилищаРезультата);
	КонецЕсли;
	
КонецПроцедуры

// Описание: Заполняет модульный контекст частичного прогресса из параметров воркера пачки (АдресРезультатаПачки — ВХ-обёртка, размер пачки).
//
// Параметры:
//   ПараметрыПачки - Структура - результат NDFL_RDU_ПодготовитьПараметрыПачки (НомерПачки, Шапка, СтрокиДатыДокументов, АдресРезультатаПачки).
//
Процедура NDFL_RDU_УстановитьКонтекстЧастичногоПрогрессаИзПараметровПачки(ПараметрыПачки)
	
	NDFL_RDU_КонтекстЧастичногоПрогресса = Неопределено;
	
	Если ПараметрыПачки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресВхОберткиРезультатаПачки = "";
	Если Не ПараметрыПачки.Свойство("АдресРезультатаПачки", АдресВхОберткиРезультатаПачки)
		Или Не ЗначениеЗаполнено(АдресВхОберткиРезультатаПачки)
		Или Не ЭтоАдресВременногоХранилища(АдресВхОберткиРезультатаПачки) Тогда
		
		Возврат;
	КонецЕсли;
	
	НомерПачки = 0;
	ПараметрыПачки.Свойство("НомерПачки", НомерПачки);
	
	СтрокВПачке = 0;
	СтрокиДатыДокументов = Неопределено;
	Если ПараметрыПачки.Свойство("СтрокиДатыДокументов", СтрокиДатыДокументов)
		И СтрокиДатыДокументов <> Неопределено Тогда
		
		СтрокВПачке = СтрокиДатыДокументов.Количество();
	КонецЕсли;
	
	NDFL_RDU_КонтекстЧастичногоПрогресса = Новый Структура(
		"АдресВхОберткиРезультатаПачки, НомерПачки, СтрокВПачке, СчетчикСтрокПачки",
		АдресВхОберткиРезультатаПачки, НомерПачки, СтрокВПачке, 0);
	
КонецПроцедуры

// Описание: Увеличивает счётчик обработанных строк ТЧ «ДатыДокументов» в пачке и раз в 10 строк
//           обновляет ОбработаноСтрокЧастично во ВХ-обёртке результата пачки (NDFL_RDU_ОбновитьЧастичныйПрогрессВоВхОбертке в менеджере).
//
Процедура NDFL_RDU_ЗафиксироватьЧастичныйПрогрессПослеСтрокиДатыДокументов()
	
	Если NDFL_RDU_КонтекстЧастичногоПрогресса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресВхОберткиРезультатаПачки = "";
	Если Не NDFL_RDU_КонтекстЧастичногоПрогресса.Свойство("АдресВхОберткиРезультатаПачки", АдресВхОберткиРезультатаПачки)
		Или Не ЗначениеЗаполнено(АдресВхОберткиРезультатаПачки)
		Или Не ЭтоАдресВременногоХранилища(АдресВхОберткиРезультатаПачки) Тогда
		
		Возврат;
	КонецЕсли;
	
	NDFL_RDU_КонтекстЧастичногоПрогресса.СчетчикСтрокПачки = NDFL_RDU_КонтекстЧастичногоПрогресса.СчетчикСтрокПачки + 1;
	
	ШагСообщенияПрогресса = 10;
	Если NDFL_RDU_КонтекстЧастичногоПрогресса.СчетчикСтрокПачки % ШагСообщенияПрогресса <> 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьЧисло = NDFL_RDU_КонтекстЧастичногоПрогресса.СчетчикСтрокПачки;
	СтрокВПачке = 0;
	NDFL_RDU_КонтекстЧастичногоПрогресса.Свойство("СтрокВПачке", СтрокВПачке);
	Если СтрокВПачке > 0 И ЗаписатьЧисло > СтрокВПачке Тогда
		ЗаписатьЧисло = СтрокВПачке;
	КонецЕсли;
	
	Обработки.ФормированиеНачисленийНДФЛ.NDFL_RDU_ОбновитьЧастичныйПрогрессВоВхОбертке(АдресВхОберткиРезультатаПачки, ЗаписатьЧисло);
	
КонецПроцедуры

// Описание: После завершения СоздатьДокументы обновляет ОбработаноСтрокЧастично во ВХ-обёртке по фактическому счётчику
//           (для строк, не кратных шагу 10, чтобы прогресс оркестратора не отставал до помещения итога пачки).
//
Процедура NDFL_RDU_ЗаписатьФинальныйЧастичныйПрогрессСтрокПачкиВоВХ()
	
	Если NDFL_RDU_КонтекстЧастичногоПрогресса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресВхОберткиРезультатаПачки = "";
	Если Не NDFL_RDU_КонтекстЧастичногоПрогресса.Свойство("АдресВхОберткиРезультатаПачки", АдресВхОберткиРезультатаПачки)
		Или Не ЗначениеЗаполнено(АдресВхОберткиРезультатаПачки)
		Или Не ЭтоАдресВременногоХранилища(АдресВхОберткиРезультатаПачки) Тогда
		
		Возврат;
	КонецЕсли;
	
	ЗаписатьЧисло = NDFL_RDU_КонтекстЧастичногоПрогресса.СчетчикСтрокПачки;
	СтрокВПачке = 0;
	NDFL_RDU_КонтекстЧастичногоПрогресса.Свойство("СтрокВПачке", СтрокВПачке);
	Если СтрокВПачке > 0 И ЗаписатьЧисло > СтрокВПачке Тогда
		ЗаписатьЧисло = СтрокВПачке;
	КонецЕсли;
	
	Обработки.ФормированиеНачисленийНДФЛ.NDFL_RDU_ОбновитьЧастичныйПрогрессВоВхОбертке(АдресВхОберткиРезультатаПачки, ЗаписатьЧисло);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// IMDEV-7330 Описание: Перехватывает типовую СоздатьНачислениеНДФЛПоПортфелю для проброса кэша
//           оборотов в РассчитатьНДФЛ. Кэш подготавливается в NDFL_RDU_СоздатьДокументы
//           до входа в типовой цикл.
//           Если кэш не построен (см. NDFL_RDU_ИнициализироватьКэшОборотовПоМассивуПар: нет пар, 0 портфелей
//           после запроса или количество портфелей меньше порога) - идёт по старому пути с РассчитатьНДФЛ() без параметров.
//
// Параметры:
//   СтрокаДокументов - СтрокаТабличнойЧасти.ДатыДокументов - текущая обрабатываемая
//                                                            пара Клиент/УК/Дата.
//   СписокСообщений  - ТаблицаЗначений - аккумулятор сообщений лога обработки.
//
&Вместо("СоздатьНачислениеНДФЛПоПортфелю")
Процедура NDFL_RDU_СоздатьНачислениеНДФЛПоПортфелю(СтрокаДокументов, СписокСообщений)
	
	// IMDEV-7330 Без изменений: сохраняем типовое условие включения формирования
	// документов по портфелю через константу.
	Если Не Константы.НачислениеНДФЛПоПортфелю.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	СписокПортфелей = СписокПортфелей(СтрокаДокументов);
	
	Для каждого ТекПортфель Из СписокПортфелей Цикл
		
		НачислениеНДФЛПоПортфелю = НайтиСоздатьДокументПоПортфелю(ТекПортфель, СтрокаДокументов.Дата);
		
		// IMDEV-7330 Если кэш есть - формируем структуру по текущему портфелю
		// и передаём в РассчитатьНДФЛ. Иначе - старый путь без параметров.
		Если NDFL_RDU_СтруктураКэшОборотов = Неопределено Тогда
			НачислениеНДФЛПоПортфелю.РассчитатьНДФЛ();
		Иначе
			ОборотыТек = NDFL_RDU_СтруктураКэшОборотов.ОборотыПоПортфелю.Получить(ТекПортфель);
			ОборотыПрошл = NDFL_RDU_СтруктураКэшОборотов.ОборотыПрошлыйГодПоПортфелю.Получить(ТекПортфель);
			ПарамВнешн = Новый Структура;
			Если ОборотыТек = Неопределено Тогда
				// IMDEV-7330 В кэше нет среза по этому портфелю: передаём пустую ТЗ с колонками как у массовой выборки,
				// чтобы РассчитатьНДФЛ(ПарамВнешн) не дернул повторный тяжёлый запрос оборотов за этот портфель внутри расчёта.
				ОборотыТек = NDFL_RDU_ПустаяТаблицаОборотов(
					NDFL_RDU_СтруктураКэшОборотов.ОборотыПоПортфелю,
					NDFL_RDU_СтруктураКэшОборотов.ШаблонОборотыТек);
			КонецЕсли;
			Если ОборотыПрошл = Неопределено Тогда
				// IMDEV-7330 Аналогично текущему периоду: пустая ТЗ прошлого года с колонками из кэша.
				ОборотыПрошл = NDFL_RDU_ПустаяТаблицаОборотов(
					NDFL_RDU_СтруктураКэшОборотов.ОборотыПрошлыйГодПоПортфелю,
					NDFL_RDU_СтруктураКэшОборотов.ШаблонОборотыПрошлыйГод);
			КонецЕсли;
			ПарамВнешн.Вставить("ОбщиеОборотыТек",        ОборотыТек);
			ПарамВнешн.Вставить("ОбщиеОборотыПрошлыйГод", ОборотыПрошл);
			НачислениеНДФЛПоПортфелю.РассчитатьНДФЛ(ПарамВнешн);
		КонецЕсли;
		
		КлиентПортфеля = ОбщегоНазначенияДУПовтИсп.ЗначенияРеквизитовПортфеля(ТекПортфель).Клиент;
		ДатаСмертиНаступила = Справочники.Контрагенты.ДатаСмертиНаступила(КлиентПортфеля, НачислениеНДФЛПоПортфелю.Дата);
		
		Если ДатаСмертиНаступила Тогда
			РеквизитыКлиента = ОбщегоНазначенияДУПовтИсп.ЗначенияРеквизитовОбъекта(ТекПортфель, "Клиент.Наименование, Клиент.ДатаСмерти");
			ТекстСообщения = СтрШаблон("Внимание, по клиенту %1 установлена дата смерти %2. Дата документа ""Начисление НДФЛ по портфелю"" должна быть меньше этой даты. Документ не создан",
				РеквизитыКлиента.КлиентНаименование,
				Формат(РеквизитыКлиента.КлиентДатаСмерти, "ДЛФ=Д"));
			ДобавитьСообщение(СписокСообщений, ТекстСообщения, НачислениеНДФЛПоПортфелю.Ссылка, Истина);
			Продолжить;
		КонецЕсли;
		
		// IMDEV-7330 Без изменений: оставляем типовую схему записи (проведение, при ошибке - запись).
		Попытка
			НачислениеНДФЛПоПортфелю.Записать(РежимЗаписиДокумента.Проведение);
			ТекстСообщения = "Проведено начисление НДФЛ по портфелю " + ТекПортфель;
			ДобавитьСообщение(СписокСообщений, ТекстСообщения, НачислениеНДФЛПоПортфелю.Ссылка);
		Исключение
			НачислениеНДФЛПоПортфелю.Записать(РежимЗаписиДокумента.Запись);
			ТекстСообщения = "Не удалось провести начисление НДФЛ по портфелю " + ТекПортфель + ". " + ОписаниеОшибки();
			ДобавитьСообщение(СписокСообщений, ТекстСообщения, НачислениеНДФЛПоПортфелю.Ссылка, Истина);
		КонецПопытки;
		
	КонецЦикла;
	
	NDFL_RDU_ЗафиксироватьЧастичныйПрогрессПослеСтрокиДатыДокументов();
	
КонецПроцедуры

// IMDEV-7330 Описание: Перехватывает типовую СоздатьНачислениеНДФЛПоУК и добавляет
//           защиту от записи "пустого" документа (без строк в табличных частях).
//           Если после расчета НДФЛ все расчетные таблицы пустые, документ не записывается.
//
// Параметры:
//   СтрокаДокументов - СтрокаТабличнойЧасти.ДатыДокументов - текущая строка отбора.
//   СписокСообщений  - ТаблицаЗначений - аккумулятор сообщений лога обработки.
//   СписокНачислений - Массив - список созданных документов для последующей оплаты.
//
&Вместо("СоздатьНачислениеНДФЛПоУК")
Процедура NDFL_RDU_СоздатьНачислениеНДФЛПоУК(СтрокаДокументов, СписокСообщений, СписокНачислений)
	
	НачислениеНДФЛПоУК = НайтиСоздатьДокументПоУК(СтрокаДокументов);
	НачислениеНДФЛПоУК.РассчитатьНДФЛ();
	
	// IMDEV-7330 Добавлено: документ не записываем, если после расчета нет строк ни в одной
	// расчетной табличной части.
	Если НачислениеНДФЛПоУК.Начисления.Количество() = 0
		И НачислениеНДФЛПоУК.Удержания.Количество() = 0
		И НачислениеНДФЛПоУК.ИнвестиционныйВычетПоПортфелям.Количество() = 0 Тогда
		ТекстСообщения = "Документ ""Начисление НДФЛ по УК"" не записан: отсутствуют данные для расчета";
		ДобавитьСообщение(СписокСообщений, ТекстСообщения, СтрокаДокументов.Клиент, Ложь, Истина);
		Возврат;
	КонецЕсли;
	
	// IMDEV-7330 Без изменений: сохраняем типовую проверку "не создавать без удержаний".
	Если НеСоздаватьДокументыБезУдержаний И НачислениеНДФЛПоУК.Удержания.Итог("СуммаКУдержанию") = 0 Тогда
		ТекстСообщения = СтрокаДокументов.СхемаРеинвестирования;
		ДобавитьСообщение(СписокСообщений, ТекстСообщения, СтрокаДокументов.Клиент, Ложь, Истина);
		Возврат;
	КонецЕсли;
	
	РеквизитыКлиента = ОбщегоНазначенияДУПовтИсп.ЗначенияРеквизитовОбъекта(СтрокаДокументов.Клиент, "ДатаСмерти, Наименование");
	
	Если ЗначениеЗаполнено(РеквизитыКлиента.ДатаСмерти) Тогда
		Если РеквизитыКлиента.ДатаСмерти <> '0001.01.01' И НачислениеНДФЛПоУК.Дата >= РеквизитыКлиента.ДатаСмерти Тогда
			ТекстСообщения = СтрШаблон("Внимание, по клиенту %1 установлена дата смерти %2. Дата документа ""Начисление НДФЛ по УК"" должна быть меньше этой даты. Документ не создан",
				РеквизитыКлиента.Наименование,
				Формат(РеквизитыКлиента.ДатаСмерти, "ДЛФ=Д"));
			ДобавитьСообщение(СписокСообщений, ТекстСообщения, НачислениеНДФЛПоУК.Ссылка, Истина);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// IMDEV-7330 Без изменений: оставляем типовую схему записи (проведение, при ошибке - запись).
	Попытка
		НачислениеНДФЛПоУК.Записать(РежимЗаписиДокумента.Проведение);
		ТекстСообщения = "Проведено начисление НДФЛ по клиенту " + СтрокаДокументов.Клиент;
		ДобавитьСообщение(СписокСообщений, ТекстСообщения, НачислениеНДФЛПоУК.Ссылка);
		Если СоздаватьОплатуНДФЛ Тогда
			СписокНачислений.Добавить(НачислениеНДФЛПоУК.Ссылка);
		КонецЕсли;
	Исключение
		НачислениеНДФЛПоУК.Записать();
		ТекстСообщения = "Не удалось провести начисление НДФЛ по клиенту " + СтрокаДокументов.Клиент + ". " + ОписаниеОшибки();
		ДобавитьСообщение(СписокСообщений, ТекстСообщения, НачислениеНДФЛПоУК.Ссылка, Истина);
	КонецПопытки;
	
КонецПроцедуры

// IMDEV-7330 Описание: Уникальные пары Клиент/УК для предрасчёта кэша по тем же правилам отбора строк ТЧ,
//           что и в начале итерации типовой СоздатьДокументы (номер строки, исключение клиентов без ЦБ при флаге).
//           Сообщение "Клиент выведен" здесь не пишется - его добавляет типовой код при обходе ДатыДокументов.
//           В воркере параллельного режима в объекте уже только строки пачки и НомерСтрокиС/По = 0 (см. менеджер), отдельный отбор по массиву номеров не нужен.
//
// Возвращаемое значение:
//   Массив - структуры с полями Клиент, УправляющаяКомпания.
//
&НаСервере
Функция NDFL_RDU_СобратьПарыКлиентУКСУчетомОтборовДокументов()
	
	ОтборПоНомеруСтроки = НомерСтрокиС <> 0 Или НомерСтрокиПо <> 0;
	
	КлиентыСЦБ = Неопределено;
	Если НеСоздаватьДокументыПоКлиентамБезЦБ Тогда
		КлиентыСЦБ = СписокКлиентовСЦБ();
	КонецЕсли;
	
	МассивПарКлиентУК = Новый Массив;
	УникПары = Новый Соответствие;
	
	Для каждого СтрокаДокументов Из ДатыДокументов Цикл
		
		Если ОтборПоНомеруСтроки Тогда
			Если НомерСтрокиС <> 0 И СтрокаДокументов.НомерСтроки < НомерСтрокиС Тогда
				Продолжить;
			ИначеЕсли НомерСтрокиПо <> 0 И СтрокаДокументов.НомерСтроки > НомерСтрокиПо Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		Если НеСоздаватьДокументыПоКлиентамБезЦБ И КлиентыСЦБ.Найти(СтрокаДокументов.Клиент) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Ключ = Строка(СтрокаДокументов.Клиент.УникальныйИдентификатор())
			+ "|" + Строка(СтрокаДокументов.УправляющаяКомпания.УникальныйИдентификатор());
		Если УникПары.Получить(Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Пара = Новый Структура("Клиент, УправляющаяКомпания");
		Пара.Клиент = СтрокаДокументов.Клиент;
		Пара.УправляющаяКомпания = СтрокаДокументов.УправляющаяКомпания;
		МассивПарКлиентУК.Добавить(Пара);
		УникПары.Вставить(Ключ, Истина);
	КонецЦикла;
	
	Возврат МассивПарКлиентУК;
	
КонецФункции

// IMDEV-7330 Описание: Однократная инициализация модульного кэша оборотов по переданным парам
//           Клиент/УК. Если пар нет, после запроса нет портфелей или их число меньше ПорогМассовогоПредрасчета -
//           процедура выходит, NDFL_RDU_СтруктураКэшОборотов остаётся Неопределено (как после сброса в начале СоздатьДокументы).
//
// Параметры:
//   МассивПарКлиентУК - Массив - структуры с полями Клиент, УправляющаяКомпания.
//
&НаСервере
Процедура NDFL_RDU_ИнициализироватьКэшОборотовПоМассивуПар(МассивПарКлиентУК)
	
	// IMDEV-7330 Порог массового предрасчёта (сейчас 1): при Количество() < 1 (т.е. 0 портфелей) кэш не строим.
	//           При одном и более портфелях выполняется пакетный запрос оборотов по всему массиву.
	ПорогМассовогоПредрасчета = 1;
	
	Если МассивПарКлиентУК.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивПортфелей = NDFL_RDU_СписокПортфелейПоКлиентам(МассивПарКлиентУК);
	
	Если МассивПортфелей.Количество() < ПорогМассовогоПредрасчета Тогда
		Возврат;
	КонецЕсли;
	
	// IMDEV-7330 Технический объект документа в памяти: только для вызова NDFL_RDU_ПолучитьОбщиеОборотыПоПортфелям, в БД не записывается.
	//           Реквизит Портфель заполняем первым элементом массива портфелей: при вызове типовой ПараметрыРасчета()
	//           нужна непустая ссылка на портфель (иначе возможны ошибки при чтении реквизитов портфеля).
	ТехДокОбъект = Документы.НачислениеНДФЛПоПортфелю.СоздатьДокумент();
	ТехДокОбъект.Портфель = МассивПортфелей[0];
	ТехДокОбъект.Дата = КонецДня(Период.ДатаОкончания);
	ТехДокОбъект.НалоговыйПериод = НалоговыйПериод;
	ТехДокОбъект.Заполнить(Неопределено);
	ТехДокОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
	ТехДокОбъект.Комментарий = "#Создан автоматически";
	ТехДокОбъект.Система = ПланыОбмена.ОбменНДФЛ.ИмяСистемы();
	ТехДокОбъект.ОтключитьЛьготированиеПроцентныхДоходовОблигаций =
		ТехДокОбъект.НалоговыйПериод.ДатаНачала >= Дата(2021, 1, 1);

	NDFL_RDU_СтруктураКэшОборотов = ТехДокОбъект.NDFL_RDU_ПолучитьОбщиеОборотыПоПортфелям(МассивПортфелей);
	
КонецПроцедуры

// IMDEV-7330 Описание: Один запрос для всех пар Клиент/УК - возвращает уникальный массив портфелей
//           по физическим лицам без пометки удаления. Аналог СписокПортфелей, но через
//           табличный параметр &ПарыКлиентУК для пакетного отбора.
//
// Параметры:
//   МассивПарКлиентУК - Массив - массив структур с полями Клиент, УправляющаяКомпания.
//
// Возвращаемое значение:
//   Массив - уникальные ссылки на портфели (СправочникСсылка.Портфели).
//
&НаСервере
Функция NDFL_RDU_СписокПортфелейПоКлиентам(МассивПарКлиентУК)
	
	ТЗПары = Новый ТаблицаЗначений;
	ТЗПары.Колонки.Добавить("Клиент",
		Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТЗПары.Колонки.Добавить("УправляющаяКомпания",
		Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Для Каждого Пара Из МассивПарКлиентУК Цикл
		НоваяСтрока = ТЗПары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Пара);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пары.Клиент КАК Клиент,
	|	Пары.УправляющаяКомпания КАК УправляющаяКомпания
	|ПОМЕСТИТЬ ВТ_Пары
	|ИЗ
	|	&Пары КАК Пары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Портфели.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Портфели КАК Портфели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Пары КАК Пары
	|		ПО Портфели.Клиент = Пары.Клиент
	|			И Портфели.УправляющаяКомпания = Пары.УправляющаяКомпания
	|ГДЕ
	|	НЕ Портфели.ПометкаУдаления
	|	И Портфели.ТипКлиентаДУ = ЗНАЧЕНИЕ(Перечисление.ТипыКлиентовДУ.ФизическиеЛица)";
	
	Запрос.УстановитьПараметр("Пары", ТЗПары);
	
	ОбщегоНазначенияДУ.ДобавитьВЛогОтладки(Запрос, "NDFL_RDU_СписокПортфелейПоКлиентам");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// IMDEV-7330 Описание: Возвращает пустую ТаблицаЗначений с теми же колонками, что и одна из таблиц
//           кэша. Используется когда по конкретному портфелю в кэше нет строк
//           (т.е. оборотов нет вообще), но нужно передать в РассчитатьНДФЛ корректный
//           объект ТаблицаЗначений вместо Неопределено.
//
// Параметры:
//   СоответствиеПортфельТаблица - Соответствие - Портфель -> ТаблицаЗначений из кэша.
//   ТаблицаШаблон - ТаблицаЗначений - шаблон колонок, если соответствие пустое.
//
// Возвращаемое значение:
//   ТаблицаЗначений - пустая таблица с колонками.
//
&НаСервере
Функция NDFL_RDU_ПустаяТаблицаОборотов(СоответствиеПортфельТаблица, ТаблицаШаблон = Неопределено)
	
	Для Каждого Элемент Из СоответствиеПортфельТаблица Цикл
		// IMDEV-7330 Берём первую попавшуюся таблицу как образец и копируем её колонки.
		Возврат Элемент.Значение.СкопироватьКолонки();
	КонецЦикла;
	
	Если ТаблицаШаблон <> Неопределено Тогда
		Возврат ТаблицаШаблон.СкопироватьКолонки();
	КонецЕсли;
	
	Возврат Новый ТаблицаЗначений;
	
КонецФункции

#КонецОбласти

#КонецЕсли
